---
kind: method
id: M:Autodesk.Revit.DB.AreaTagFilter.#ctor
source: html/bc1a2ad4-f29b-6fdc-25e3-774323dc0dc8.htm
---
# Autodesk.Revit.DB.AreaTagFilter.#ctor Method

Constructs a filter which matches only areas.

## Syntax (C#)
```csharp
public AreaTagFilter()
```